Revit 2026 API

# DialogBoxShowingEventArgs Properties

---

The DialogBoxShowingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

#### Reference

DialogBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace